app/controllers/centrodecustos_controller.rb

  def index
    @centrodecustos = Centrodecusto.all
---
SELECT `centrodecustos`.* FROM `centrodecustos`

  def show
    @centrodecusto = Centrodecusto.find(params[:id])
---
SELECT `centrodecustos`.* FROM `centrodecustos` WHERE `centrodecustos`.`id` = 13 LIMIT 1

  def edit
    @centrodecusto = Centrodecusto.find(params[:id])
---
SELECT `centrodecustos`.* FROM `centrodecustos` WHERE `centrodecustos`.`id` = 1 LIMIT 1

  def create
    @centrodecusto = Centrodecusto.new(params[:centrodecusto])

    if @centrodecusto.save
---
INSERT INTO `centrodecustos` (`ancestry`, `created_at`, `descricao`, `updated_at`) VALUES (NULL, '2013-03-10 22:49:31', NULL, '2013-03-10 22:49:31')

  def update
    @centrodecusto = Centrodecusto.find(params[:id])
---
SELECT `centrodecustos`.* FROM `centrodecustos` WHERE `centrodecustos`.`id` = 7 LIMIT 1

  def destroy
    @centrodecusto = Centrodecusto.find(params[:id])
    @centrodecusto.destroy
---
SELECT `centrodecustos`.* FROM `centrodecustos` WHERE (centrodecustos.ancestry like '5/%' or centrodecustos.ancestry = '5')
DELETE FROM `centrodecustos` WHERE `centrodecustos`.`id` = 5