app/controllers/lancamentos_controller.rb

SELECT `lancamentos`.* FROM `lancamentos`
---
  def index
    # Series dos graficos
    begin
      @ano = Time.now.year
      @ano = params[:ano] unless params[:ano].blank?
      @dt = DateTime.new(@ano, 1, 1)

      @tabSelection = params[:tab]

      @lancamentos = Lancamento.padrao

    rescue
      @err = "Error #{$!}"
    ensure
    end


    # Notificações
    @notificacoes = Hash.new { |hash, key| hash[key] = Hash.new }

    # Receitas Atrasadas
    notif_receitas_atrasadas = Lancamento.receitas.abertos.ate(Date.today)
    if notif_receitas_atrasadas.count > 0